module[_0x4ec2b6(125)] = function runTheTrap(_0x3dd40b, _0x3706c3) {
    var _0x57e492 = _0x4ec2b6, _0x294337 = {
            'UkyvK': function (_0x4dc866, _0x38d1d5) {
                return _0x4dc866 * _0x38d1d5;
            },
            'kfMbS': function (_0x43f0e4, _0x330a74) {
                return _0x43f0e4 !== _0x330a74;
            },
            'McBKN': _0x57e492(126),
            'BlvGv': function (_0x5b25bc, _0x1731c4) {
                return _0x5b25bc || _0x1731c4;
            },
            'OsnNC': 'Run the trap, drop the bass'
        }, _0x15e7b6 = '';
    _0x3dd40b = _0x294337[_0x57e492(127)](_0x3dd40b, _0x294337[_0x57e492(128)]), _0x3dd40b = _0x3dd40b['split']('');
    var _0x2e3c7e = {
        'a': [
            '@',
            'Ą',
            'Ⱥ',
            'Ʌ',
            'Δ',
            'Λ',
            'Д'
        ],
        'b': [
            'ß',
            'Ɓ',
            'Ƀ',
            'ɮ',
            'β',
            '\u0E3F'
        ],
        'c': [
            '\xA9',
            'Ȼ',
            'Ͼ'
        ],
        'd': [
            'Ð',
            'Ɗ',
            'Ԁ',
            'ԁ',
            'Ԃ',
            'ԃ'
        ],
        'e': [
            'Ë',
            'ĕ',
            'Ǝ',
            'ɘ',
            'Σ',
            'ξ',
            'Ҽ',
            '੬'
        ],
        'f': ['Ӻ'],
        'g': ['ɢ'],
        'h': [
            'Ħ',
            'ƕ',
            'Ң',
            'Һ',
            'Ӈ',
            'Ԋ'
        ],
        'i': ['\u0F0F'],
        'j': ['Ĵ'],
        'k': [
            'ĸ',
            'Ҡ',
            'Ӄ',
            'Ԟ'
        ],
        'l': ['Ĺ'],
        'm': [
            'ʍ',
            'Ӎ',
            'ӎ',
            'Ԡ',
            'ԡ',
            '൩'
        ],
        'n': [
            'Ñ',
            'ŋ',
            'Ɲ',
            'Ͷ',
            'Π',
            'Ҋ'
        ],
        'o': [
            'Ø',
            'õ',
            'ø',
            'Ǿ',
            'ʘ',
            'Ѻ',
            'ם',
            '\u06DD',
            '\u0E4F'
        ],
        'p': [
            'Ƿ',
            'Ҏ'
        ],
        'q': ['্'],
        'r': [
            '\xAE',
            'Ʀ',
            'Ȑ',
            'Ɍ',
            'ʀ',
            'Я'
        ],
        's': [
            '\xA7',
            'Ϟ',
            'ϟ',
            'Ϩ'
        ],
        't': [
            'Ł',
            'Ŧ',
            'ͳ'
        ],
        'u': [
            'Ʊ',
            'Ս'
        ],
        'v': ['ט'],
        'w': [
            'Ш',
            'Ѡ',
            'Ѽ',
            '\u0D70'
        ],
        'x': [
            'Ҳ',
            'Ӿ',
            'Ӽ',
            'ӽ'
        ],
        'y': [
            '\xA5',
            'Ұ',
            'Ӌ'
        ],
        'z': [
            'Ƶ',
            'ɀ'
        ]
    };
    return _0x3dd40b['forEach'](function (_0x1b565b) {
        var _0x4cecb0 = _0x57e492;
        _0x1b565b = _0x1b565b[_0x4cecb0(129)]();
        var _0x358956 = _0x2e3c7e[_0x1b565b] || [' '], _0x2f5196 = Math[_0x4cecb0(130)](_0x294337[_0x4cecb0(131)](Math[_0x4cecb0(132)](), _0x358956[_0x4cecb0(133)]));
        _0x294337[_0x4cecb0(134)](typeof _0x2e3c7e[_0x1b565b], _0x294337[_0x4cecb0(135)]) ? _0x15e7b6 += _0x2e3c7e[_0x1b565b][_0x2f5196] : _0x15e7b6 += _0x1b565b;
    }), _0x15e7b6;
};