function _0x5f09(_0x2ecada, _0x432219) {
    return _0x5f09 = function (_0x14ef33, _0x5f09e4) {
        _0x14ef33 = _0x14ef33 - 382;
        var _0x378c1d = _0x14ef[_0x14ef33];
        return _0x378c1d;
    }, _0x5f09(_0x2ecada, _0x432219);
}
angular[_0x7a4e62(393)]('ngLocale', [], [
    _0x7a4e62(394),
    function (_0x59fa04) {
        var _0x105634 = _0x7a4e62, _0x2d4f11 = {
                'ZERO': _0x105634(395),
                'ONE': _0x105634(396),
                'TWO': _0x105634(397),
                'FEW': 'few',
                'MANY': _0x105634(398),
                'OTHER': 'other'
            };
        _0x59fa04[_0x105634(399)](_0x105634(400), {
            'DATETIME_FORMATS': {
                'AMPMS': [
                    _0x105634(401),
                    _0x105634(402)
                ],
                'DAY': [
                    _0x105634(403),
                    _0x105634(404),
                    'วันอังคาร',
                    _0x105634(405),
                    'วันพฤหัสบดี',
                    _0x105634(406),
                    _0x105634(407)
                ],
                'ERANAMES': [
                    _0x105634(408),
                    'คริสต์ศักราช'
                ],
                'ERAS': [
                    _0x105634(409),
                    _0x105634(410)
                ],
                'FIRSTDAYOFWEEK': 6,
                'MONTH': [
                    _0x105634(411),
                    _0x105634(412),
                    'มีนาคม',
                    _0x105634(413),
                    'พฤษภาคม',
                    'มิถุนายน',
                    _0x105634(414),
                    _0x105634(415),
                    _0x105634(416),
                    'ตุลาคม',
                    _0x105634(417),
                    _0x105634(418)
                ],
                'SHORTDAY': [
                    'อา.',
                    'จ.',
                    'อ.',
                    'พ.',
                    _0x105634(419),
                    'ศ.',
                    'ส.'
                ],
                'SHORTMONTH': [
                    _0x105634(420),
                    _0x105634(421),
                    'มี.ค.',
                    _0x105634(422),
                    _0x105634(423),
                    _0x105634(424),
                    _0x105634(425),
                    _0x105634(426),
                    _0x105634(427),
                    _0x105634(428),
                    _0x105634(429),
                    'ธ.ค.'
                ],
                'STANDALONEMONTH': [
                    _0x105634(411),
                    'กุมภาพันธ์',
                    'มีนาคม',
                    _0x105634(413),
                    'พฤษภาคม',
                    'มิถุนายน',
                    _0x105634(414),
                    _0x105634(415),
                    _0x105634(416),
                    _0x105634(430),
                    _0x105634(417),
                    _0x105634(418)
                ],
                'WEEKENDRANGE': [
                    5,
                    6
                ],
                'fullDate': _0x105634(431),
                'longDate': _0x105634(432),
                'medium': _0x105634(433),
                'mediumDate': _0x105634(434),
                'mediumTime': _0x105634(435),
                'short': _0x105634(436),
                'shortDate': _0x105634(437),
                'shortTime': _0x105634(438)
            },
            'NUMBER_FORMATS': {
                'CURRENCY_SYM': '\u0E3F',
                'DECIMAL_SEP': '.',
                'GROUP_SEP': ',',
                'PATTERNS': [
                    {
                        'gSize': 3,
                        'lgSize': 3,
                        'maxFrac': 3,
                        'minFrac': 0,
                        'minInt': 1,
                        'negPre': '-',
                        'negSuf': '',
                        'posPre': '',
                        'posSuf': ''
                    },
                    {
                        'gSize': 3,
                        'lgSize': 3,
                        'maxFrac': 2,
                        'minFrac': 2,
                        'minInt': 1,
                        'negPre': '-\xA4',
                        'negSuf': '',
                        'posPre': '\xA4',
                        'posSuf': ''
                    }
                ]
            },
            'id': 'th',
            'localeID': 'th',
            'pluralCat': function (_0x288baa, _0x3abf5c) {
                return _0x2d4f11['OTHER'];
            }
        });
    }
]);